[
    {
        "projects" : [
            {
                "id" : "ww",
                "title" : "The World Works",
                "tech" : ["react","nodejs","rds"],
                "projects" : [
                    {
                        "alt_title" : 0,
                        "desc"  : "With a collection of data scraped from many different resources, I was able to build an interactive map that gives you a look at a vast array of cost of living and wage statistics for over 19,000 cities and 3,000 occupiation titles. It has been in development since July of 2020.",
                        "link" : "https://"
                    }    
                ]
            },
            {
                "id" : "dtb",
                "title" : "The Digital Toolbox",
                "tech" : ["lara", "php","ang"],
                "projects" : [
                    {
                        "alt_title" : 0,
                        "desc"  : "This is my pride and joy in terms of my professional web development experience so far. The DTB is a multi-domain learning platform, a lightweight LMS, featuring an administrative back-end, loaded with internal tooling that I have crafted for Demme Learning over the years!",
                        "link" : "<a target='_blank' href='https://digital.demmelearning.com'>https://digital.demmelearning.com</a>"
                    }    
                ]
            },
            {
                "id" : "api",
                "title" : "Personal API",
                "tech" : ["flask", "py"],
                "projects" : [
                    {
                        "alt_title" : 0,
                        "desc"  : "I use Heroku to host a Python Flask server. It is currently being used to service any means of data transfer I require, though at the present it is only being used to relay tweets to my game client, Personal Space Invaders.",
                        "link" : "https://alyrist.herokuapp.com/twit?h=&lt;any_twitter_handle&gt;"
                    }    
                ]
            },
            {
                "id" : "ocv",
                "title" : "OpenCV & Embedded Systems",
                "tech" : ["cpp","vs","ocv"],
                "projects" : [
                    {
                        "alt_title" : 0,
                        "desc"  : "I've always wanted to dive head-first into robotics and electrical engineering. Click here to see my robot buddy. It can see you too!",
                        "link" : "https://"
                    }    
                ]
            },
            {
                "id" : "fsim",
                "title" : "Retro Flight Simulator",
                "tech" : ["cpp", "vs"],
                "projects" : [
                    {
                        "alt_title" : 0,
                        "desc"  : "Using the Pixel Game Engine, developed by @javidx9 and supported by the One-Lone-Coder community, this project is an ongoing love affair with game development. As of March 21 2021, it has been optimized to work within the Emscripten toolchain.",
                        "link" : "https://"
                    }    
                ]
            },
            {
                "id" : "psi",
                "title" : "Personal Space Invaders",
                "tech" : ["py","pgame"],
                "projects" : [
                    {
                        "alt_title" : 0,
                        "desc"  : "Personal space invaders started as a silly idea turned proof-of-concept. A Python PyGame client accesses the Twitter API using my personal API, conducts a sentiment analysis to determine the 'difficulty' of the gameplay, and proceeds to turn each tweet into a game of Space invaders; where each tweet can be disassembled (blasted into oblivion with a variety of powerups and weapons) character by characters. The game was not distributed for legal reasons, and not to mention that it was built by a novice at the time!",
                        "link" : "<a href='https://www.reddit.com/r/gamedev/comments/7z41jr/i_made_a_game_that_lets_you_shoot_at_any_persons/' target='_blank'>Check out the Reddit post</a>"
                    }    
                ]
            },
            {
                "id" : "steg",
                "title" : "Steganography Web App & CLI",
                "tech" : ["py","flask"],
                "projects" : [
                    {
                        "alt_title" : 0,
                        "desc"  : "A web application and learning tool that I built using Python. It is your conventional steganographic image processor. Conceal text, encrypt entire books into an image, or hide away all of those love letters. The CLI version is available on github, which also offers the\"inspector\" switch.",
                        "link" : "<a href='https://alyrist.herokuapp.com' target='_blank'>https://alyrist.herokuapp.com</a>"
                    }    
                ]
            },
            {
                "id" : "port",
                "title" : "My Portfolio",
                "tech" : ["ang", "ts"],
                "projects" : [
                    {
                        "alt_title" : 0,
                        "desc"  : "To check out the porcelain and plumbing of this webpage, check out the source code here! Like it? It's yours! <p>Disclaimer: Experience not included.<p>",
                        "link" : "<a href='https://github.com/YoshiDesign/resume' target='_blank'>Check out the repo on Github</a>"
                    }    
                ]
            }
        ]
    },
    {
        "achievements" : [
            { 
                "id" : "cs50ai",
                "title" : "Harvard CS50-AI",
                "tech" : ["tab","pdf"],
                "desc"  : "Introduction to Artificial Intelligence with Python. This course taught me the concepts and algorithms at the foundation of modern artificial intelligence. I took my education in AI 1 step further and began using Jupyter Labs as a platform for which to practice ML concepts.",
                "alt_title" : 0
            },
            {
                "id" : "cs50x",
                "title" : "Harvard CS50",
                "tech" : ["tab","pdf"],
                "desc"  : "Introduction to Computer Science. Taught by the mighty David Malan, Gordon McKay Professor of the Practice of Computer Science. This course was so amazing that I began taking it a 2nd time. I was a very active tutor on the CS50 reddit long after completion which subsequently prompted the creation of my WordPress blog.",
                "alt_title" : 0
            },
            { 
                "id" : "cs50b",
                "title" : "Harvard CS50-B",
                "tech" : ["tab","pdf"],
                "desc"  : "Computer Science for Business Professionals. Also taught by David Malan, this class focused more on the abstractions which computer science offers in your business domain. It covers everything from network architecure to cloud computing and security.",
                "alt_title" : 0
            },
            {
                "id" : "aplus",
                "title" : "CompTIA A+",
                "tech" : ["tab","pdf"],
                "desc"  : "Certifies general knowledge & practices in hardware, networking and software in the field of Information Technology.",
                "alt_title" : 0
            },
            {
                "id" : "cysa",
                "title" : "CompTIA CySA+",
                "tech" : ["tab","pdf"],
                "desc"  : "A much more involved certificate, the CySA+ demonstrates knowledge and practical skills in the fields of Cyber Forensics and Cyber Defense. Through this certification I have learned how to utilize many of the tools available in the Ethical Hacker's toolbelt.",
                "alt_title" : 0
            }
        ]
    },
    {
        "others_roles" : [
            {
                "id" : 1,
                "title" : "Web Developer at Demme Learning",
                "tech": [],
                "projects" : [
                    {
                        "alt_title" : 0,
                        "desc"  : "My first job as a developer had me thrusting through the responsibilities of a senior level developer. Becoming overqualified prior to my first career move was certainly warranted. My first major success was designing and developing a fully custom single-sign-on surface for their primary domain. It features OpenSSL and required a deep dive into the mechanisms of RFC6265."
                    }    
                ]
            }
        ]
    }
]